{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Задание №7"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Профессору Трелони надоело, что ее предсказания обычно негативные, поэтому она решила попробовать гадать на недавно появившейся новинке — Численных Картах Таро. Чтобы ее прогнозы были как можно более позитивными, она хочет выбрать для этого самую подходящую колоду. Однако она совершенно не понимает, какую следует взять, поэтому профессор Трелони обратилась за помощью к вам.\n",
    "\n",
    "Известно, что гадание на Численных Картах Таро выглядит следующим образом. Каждая карта соответствует некоторому целому числу в диапазоне от 1 до $M$ ($1 ≤ M ≤ 50000$). При этом значения карт в одной колоде могут повторяться. Профессор Трелони три раза проделывает следующий трюк. Она вытягивает случайную карту из колоды, а потом записывает ее значение в блокнот для предсказаний. Потом, чтобы не испортить магические свойства колоды, она возвращает карту обратно. После того, как профессор выпишет три числа, она делает свое предсказание, основываясь на сумме наибольшего и наименьшего из них. Известно, что чем больше сумма, тем лучше получается предсказание, поэтому вам необходимо найти колоду, у которой математическое ожидание этой величины будет наибольшим.\n",
    "\n",
    "**Формат ввода**\n",
    "\n",
    "Первая строка содержит число $N (0 < N ≤ 20)$ — количество колод. На следующих $2n$ строках вводятся сами колоды. На строчке с номером $2k$ написано натуральное число $n_k (0 < n_k ≤ 100000)$ — размер колоды с номером $k$. На строчке с номером $2k + 1$ через пробел вводятся $n_k$ чисел — сами карты. Карты в колоде не отсортированы (могут идти в произвольном порядке).\n",
    "\n",
    "**Формат вывода**\n",
    "\n",
    "Необходимо вывести два числа через пробел — номер колоды, которая лучше всего подойдет профессору Трелони и математическое ожидание для нее (с точностью до $10^{-4}$). Если таких несколько, выведите колоду с наименьшим номером.\n",
    "\n",
    "**Примечание:**\n",
    "\n",
    "* Считывание данных с файла `input.txt`.\n",
    "* Карты в колоде не отсортированы, они могут идти в произвольном порядке.\n",
    "\n",
    "**Пример ввода:**\\\n",
    "`2`\\\n",
    "`8`\\\n",
    "`1 2 2 3 3 3 3 4`\\\n",
    "`5`\\\n",
    "`1 1 4 5 6`\n",
    "\n",
    "**Пример вывода:**\n",
    "\n",
    "`2 6.8000`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 6.8000\n"
     ]
    }
   ],
   "source": [
    "import numpy as np\n",
    "\n",
    "# Считывание данных из файла\n",
    "with open('input.txt', 'r') as file:\n",
    "    lines = file.read().splitlines()\n",
    "\n",
    "num_decks = int(lines[0])\n",
    "deck_sizes = []\n",
    "decks = [(int(lines[i]), list(map(int, lines[i + 1].split()))) for i in range(1, 2 * num_decks + 1, 2)]\n",
    "\n",
    "# Инициализация максимального значения и ответа\n",
    "max_expectation, ans = 0, 0\n",
    "\n",
    "# Обработка каждой колоды\n",
    "for deck_index, (deck_size, cards) in enumerate(decks):\n",
    "    cards = np.array(cards)\n",
    "    sorted_cards = np.sort(cards)\n",
    "    reversed_cards = sorted_cards[::-1]\n",
    "\n",
    "    # Вычисление ожидаемых значений максимума и минимума\n",
    "    indices = np.array(range(deck_size))\n",
    "    weights = ((indices + 1) ** 3 - indices ** 3) / deck_size ** 3\n",
    "    expected_max = np.sum(sorted_cards * weights)\n",
    "    expected_min = np.sum(reversed_cards * weights)\n",
    "\n",
    "    # Вычисление общего ожидаемого значения\n",
    "    expectation = expected_min + expected_max\n",
    "\n",
    "    # Проверка, является ли текущая колода лучшей\n",
    "    if expectation > max_expectation:\n",
    "        max_expectation, ans = expectation, deck_index + 1\n",
    "\n",
    "print(f'{ans} {max_expectation:.4f}')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
